Reports/РасходПленки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>РасходПленки</Name>
			<Comment>Расход пленки</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/РасходМатериаловНаПроизводстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасходМатериаловНаПроизводстве</Name>
			<Comment>Расход материалов на производстве</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВБазовыхЕдиницах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСписания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/РасходПленки/Forms/УДАЛИТЬ_ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьНаСервере()
	
	Таб = Новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетРасходПленки";
	ВремОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ВремОбъект.ПолучитьМакет("УДАЛИТЬ_Макет");
		
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Отчет");
	ОбластьМакета.Параметры.НачалоПериода = Формат(Отчет.НачалоПериода,"ДЛФ=Д");
	ОбластьМакета.Параметры.КонецПериода = Формат(Отчет.КонецПериода,"ДЛФ=Д");
	Таб.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Материал");
	Таб.Присоединить(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Остаток");
	Таб.Присоединить(ОбластьМакета);
	 
	КолвоКритериев = 0;
	УсловиеЗапроса = "";
	Если НЕ Организация.Пустая() Тогда 
		УсловиеЗапроса = "ГДЕ
		|	РасходМатериаловНаПроизводствеОбороты.Регистратор.Организация В ИЕРАРХИИ(&Организация)";
		КолвоКритериев = КолвоКритериев + 1;
	КонецЕсли;
	Если НЕ Контрагент.Пустая() Тогда 
		УсловиеЗапроса = УсловиеЗапроса + ?(КолвоКритериев > 0, " И ", "ГДЕ ");
		УсловиеЗапроса = УсловиеЗапроса + "РасходМатериаловНаПроизводствеОбороты.Регистратор.Основание.Контрагент В ИЕРАРХИИ (&Контрагент)";
		КолвоКритериев = КолвоКритериев + 1;
	КонецЕсли;
	Если НЕ ВидПленки.Пустая() Тогда 
		УсловиеЗапроса = УсловиеЗапроса + ?(КолвоКритериев > 0, " И ", "ГДЕ ");
		УсловиеЗапроса = УсловиеЗапроса + "РасходМатериаловНаПроизводствеОбороты.Номенклатура В ИЕРАРХИИ (&ВидПленки)";
		КолвоКритериев = КолвоКритериев + 1;
	КонецЕсли;
	Если НЕ Характеристика.Пустая() Тогда 
		УсловиеЗапроса = УсловиеЗапроса + ?(КолвоКритериев > 0, " И ", "ГДЕ ");
		УсловиеЗапроса = УсловиеЗапроса + "РасходМатериаловНаПроизводствеОбороты.ХарактеристикаНоменклатуры В ИЕРАРХИИ (&Характеристика)";
		КолвоКритериев = КолвоКритериев + 1;
	КонецЕсли;
	Если НЕ Серия.Пустая() Тогда 
		УсловиеЗапроса = УсловиеЗапроса + ?(КолвоКритериев > 0, " И ", "ГДЕ ");
		УсловиеЗапроса = УсловиеЗапроса + "РасходМатериаловНаПроизводствеОбороты.СерияНоменклатуры В ИЕРАРХИИ (&Серия)";
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходМатериаловНаПроизводствеОбороты.Регистратор.Номер КАК Номер,
	|	РасходМатериаловНаПроизводствеОбороты.Регистратор.Дата КАК Дата,
	|	РасходМатериаловНаПроизводствеОбороты.НомерРасчета,
	|	РасходМатериаловНаПроизводствеОбороты.Номенклатура КАК Номенклатура,
	|	РасходМатериаловНаПроизводствеОбороты.СерияНоменклатуры,
	|	РасходМатериаловНаПроизводствеОбороты.ХарактеристикаНоменклатуры,
	|	РасходМатериаловНаПроизводствеОбороты.КоличествоОборот КАК Количество,
	|	РасходМатериаловНаПроизводствеОбороты.ЕдиницаИзмерения,
	|	РасходМатериаловНаПроизводствеОбороты.ЕдиницаИзмерения.Коэффициент,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА РасходМатериаловНаПроизводствеОбороты.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерений
	|			ТОГДА ЕСТЬNULL(РасходМатериаловНаПроизводствеОбороты.ЕдиницаИзмерения.Коэффициент * РасходМатериаловНаПроизводствеОбороты.КоличествоОборот, 0)
	|		ИНАЧЕ ЕСТЬNULL(РасходМатериаловНаПроизводствеОбороты.КоличествоОборот, 0)
	|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Площадь,
	|	РасходМатериаловНаПроизводствеОбороты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасходМатериаловНаПроизводстве.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК РасходМатериаловНаПроизводствеОбороты
	|" + УсловиеЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	ЕдиницаИзмерения, Дата
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Площадь)
	|ПО
	|	Регистратор,
	|	Номенклатура";
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",	КонецДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ВидПленки", 		ВидПленки);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Серия", 			Серия);

	
	Ном = 1;
	ИтогоПлощадь = 0;
	ИтогоОстаток = 0;
	ИтогоКоличество = 0;
	
	ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() Цикл
		ВыборкаНоменклатура = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ВыборкаЗапись = ВыборкаНоменклатура.Выбрать();
			Пока ВыборкаЗапись.Следующий() Цикл
				ВыводитьСтрокуВОтчет = Ложь;
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Отчет");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ВыборкаЗапись);
				ОбластьМакета.Параметры.НомерПП = Ном;
				ОбластьМакетаМатериал = Макет.ПолучитьОбласть("Строка|Материал");
				ОбластьМакетаОстаток = Макет.ПолучитьОбласть("Строка|Остаток");
				Если (ВыборкаЗапись.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно)
					И НЕ (ВыборкаЗапись.Номенклатура = Справочники.Номенклатура.ОстаткиПленки)
					И Не (ВыборкаЗапись.Номенклатура = Справочники.Номенклатура.ПолотноЗаказчика) Тогда
					ОбластьМакетаМатериал.Параметры.Номенклатура = ВыборкаЗапись.Номенклатура;
					ОбластьМакетаМатериал.Параметры.Количество = ВыборкаЗапись.Количество;
					ОбластьМакетаМатериал.Параметры.ЕдиницаИзмерения = ВыборкаЗапись.ЕдиницаИзмерения;
					ОбластьМакетаМатериал.Параметры.СерияНоменклатуры = ВыборкаЗапись.СерияНоменклатуры;
					ОбластьМакетаМатериал.Параметры.ХарактеристикаНоменклатуры = ВыборкаЗапись.ХарактеристикаНоменклатуры;
					ОбластьМакетаМатериал.Параметры.Площадь = ВыборкаЗапись.Площадь;
					ИтогоПлощадь = ИтогоПлощадь + ВыборкаЗапись.Площадь;
					ВыводитьСтрокуВОтчет = Истина;
					ИтогоКоличество = ИтогоКоличество + ВыборкаЗапись.Количество;
				ИначеЕсли ВыборкаЗапись.Номенклатура = Справочники.Номенклатура.ОстаткиПленки 
					Или ВыборкаЗапись.Номенклатура = Справочники.Номенклатура.ПолотноЗаказчика Тогда
					ОбластьМакетаМатериал.Параметры.Номенклатура = ВыборкаЗапись.Номенклатура;
					ОбластьМакетаОстаток.Параметры.ОстатокКоличество = ВыборкаЗапись.Количество;
					ИтогоОстаток = ИтогоОстаток + ВыборкаЗапись.Количество;
					ВыводитьСтрокуВОтчет = Истина;
				КонецЕсли;
				Если ВыводитьСтрокуВОтчет Тогда
					Таб.Вывести(ОбластьМакета);
					Таб.Присоединить(ОбластьМакетаМатериал);
					Таб.Присоединить(ОбластьМакетаОстаток);
					Ном = Ном + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого|Отчет");
	Таб.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Итого|Материал");
	ОбластьМакета.Параметры.ИтогоПлощадь = ИтогоПлощадь;
	Если ИтогоКоличество > 0 Тогда
		ОбластьМакета.Параметры.ИтогоКоличество = ИтогоКоличество;
	КонецЕсли;
	Таб.Присоединить(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Итого|Остаток");
	ОбластьМакета.Параметры.ИтогоОстаток = ИтогоОстаток;
	Таб.Присоединить(ОбластьМакета);
	
	Возврат Таб;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеИспользовать");
	ТабличныйДокумент = СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	Отчет.КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ВидПленкиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СерииПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеАктуальность");
КонецПроцедуры
